library/app/controllers/books_controller.rb

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("amount", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 2], ["created_at", Wed, 20 Mar 2013 05:36:29 UTC +00:00], ["name", "程序员修炼之道"], ["updated_at", Wed, 20 Mar 2013 05:36:29 UTC +00:00]]

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "amount" = 3, "updated_at" = '2013-03-20 05:36:34.517006' WHERE "books"."id" = 1

  def lend
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]