library/app/controllers/lending_books_controller.rb

  def destroy
    @lending_book = current_user.lending_books.find(params[:id])
    @lending_book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "lending_books".* FROM "lending_books" WHERE "lending_books"."user_id" = 1 AND "lending_books"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "lending_books" WHERE "lending_books"."id" = ?  [["id", 1]]